trade_exp/src/Documents/ПриемкаСдачаВыполненныхРаботУслуг/ПриемкаСдачаВыполненныхРаботУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9b7637e6-ce8c-4067-a7ab-aebee7fb6068">
  <name>ПриемкаСдачаВыполненныхРаботУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="640075d1-a883-4c59-80f6-31455d14d3e4">
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8e1639f-b53e-4a57-a69d-df84fb1c3396">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be9259cc-6103-496f-b8da-c2eaae517f04">
    <name>КоличествоВыданныхПарПерчаток</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a815d23c-6101-4320-825f-c5d68475b788">
    <name>Подрядчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed5f409f-4846-44eb-a9f4-914ca9bd7fa5">
    <name>ВыполненныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2daf44ca-f6c9-4c0a-b088-30fe5c7042a0">
    <name>ОтправленоЭП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4811f6e-5f29-4eed-9385-a3228fb84314">
    <name>НомерАкта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a09a2e36-26bb-40d4-8abd-3fc7f0c422cd">
    <name>ПланСотрудники</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7535430-f6c8-449f-85ef-104dd350e722">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7396208-385c-44b3-9e3e-8ccfa1c8a787">
    <name>Клининг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="9cd10099-ed23-4d2c-8d9a-e50b648b9689">
    <name>Работы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c65163bf-7640-4259-b94a-ab619bda8de8">
      <name>ФИОРаботника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="155b467d-4312-4d30-aa15-b97581ea6489">
      <name>ВидРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c4b195d-a7b1-4a77-a8ff-90fbe2212df9">
      <name>ДатаИВремяНачалаРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="82b83517-8cd6-4f21-8ab5-f0663cee7bf8">
      <name>ДатаИВремяОкончанияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d748c77f-4708-4cbe-b920-f0768ef4f4bb">
      <name>ВремяФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8ba97333-0eeb-400e-8a1e-fb654d8dd31f">
      <name>Тариф</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="326208a3-3feb-44b6-b643-bce0dff7d121">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="022dd625-7a4a-43b0-b5ba-60f92e90f97b">
      <name>КомментарийККачествуВыполненияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d707e412-8c2b-42a5-8b58-02f355325460">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09a7ae30-c9ad-449f-a5b4-48324c8c81c7">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="387ddfc6-b06b-46b8-8b0a-344bb038777f">
      <name>ОплатаПодрядчику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>12</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="920d3dfb-a4ed-471e-8227-326fddde53ae">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="35c83be2-866b-431b-abf2-4386792699b4">
      <name>Банк</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>120</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4795be15-525d-4650-9923-ef841e2026f3">
      <name>ДатаРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b6ce7b63-cc17-4f8b-bc12-d769e73575bb">
      <name>КлинингПлощадь</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d86a4e2c-0ca3-425f-890a-25eeb78fb619">
      <name>КлинингВыполненныеРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dae401cc-8b1f-4bb3-a37c-45d743269dc9">
      <name>КлинингОценкаКачества</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1623805c-3e9f-40ab-855c-145ccf50a77c">
      <name>КлинингТариф</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/БанковскиеСчетаКонтрагентов/БанковскиеСчетаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>БанковскиеСчетаКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.ФизическиеЛица</owners>
  <attributes extendedConfigurationObject="9e7b0920-3d4f-481a-9dce-a789a4e9ef73">
    <name>Банк</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ab286fc-0785-45c6-aa76-667fde1bec5b">
    <name>РучноеИзменениеРеквизитовБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4dadf416-15f2-45a0-ae14-6f21b71cc9ea">
    <name>НомерСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>34</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eee52b99-d33f-47a4-a6fd-13c8ce88b8b2">
    <name>БИКБанка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c5a17a6f-47b9-42ab-b8b5-3985227107cf">
    <name>НаименованиеБанка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7d98c43b-d02b-46d2-a577-8d0f7560573f">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="698e12bd-9dbd-4d8f-962a-c7642a295bca">
    <name>ГородБанка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9aaf3665-a762-4398-84f3-5ede5a9ff3a1">
    <name>ВалютаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ПриемкаСдачаВыполненныхРаботУслуг/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПечатьВыделеного(Команда)
	Если НЕ АльтерраОбщегоНазначения._РольДоступна("ДобавлениеИзменениеПриемкаСдачаВыполненыхРаботУслуг") И НЕ АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава") И НЕ АльтерраОбщегоНазначения._РольДоступна("СлужбаПерсонала") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Недостаточно прав для формирования акта");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Исполнитель");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Организация");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидРабот) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле Вид работ");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаНачало) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен Период");
		Возврат;
	КонецЕсли;
	
	МассивДокументов = ПолучитьМассивДокументовСервер(Исполнитель, Организация, ВидРабот, ДатаНачало, ДатаОкончания);
	Если МассивДокументов = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найдено ни одного документа");
		Возврат;
	КонецЕсли;
	НомерАкта = 0;
	ПолучитьНомерАкта = ПолучитьНомерАктаСервер();
	Если ПолучитьНомерАкта <> Неопределено Тогда
		НомерАкта = ПолучитьНомерАкта + 1;
	Иначе
		НомерАкта = НомерАкта + 1;
	КонецЕсли;
	Коллекция = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПриемкаСдачаРаботМакет");
	ТабДокумент = Новый ТабличныйДокумент;
	n=1;
	ИтогиСумма = 0;
	ТабДокумент = ПечатьНаСервере(ТабДокумент, МассивДокументов, НомерАкта);
	Для Каждого Документ ИЗ МассивДокументов Цикл
		Структура = ПечатьНаСервереТабличнаяЧасть(ТабДокумент,Документ,n, ИтогиСумма);
		ТабДокумент = Структура.ТабДокумент;
		ИтогиСумма = Структура.ИтогиСумма;
		n = n + 1;
	КонецЦикла;
	ТабДокумент = ПечатьИтоговСервер(ТабДокумент, ИтогиСумма);
	СтруктураКоллекции = Коллекция.Получить(0);
	СтруктураКоллекции.ТабличныйДокумент = ТабДокумент;
	ЗаписатьНомераАктаДокумен(МассивДокументов, НомерАкта);
	УправлениеПечатьюКлиент.ПечатьДокументов(Коллекция);	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНомераАктаДокумен(МассивДокументов, НомерАкта)
	НачатьТранзакцию();
	Попытка
		Для Каждого Документ ИЗ МассивДокументов Цикл
			Документ = Документ.ПолучитьОбъект();
			Документ.НомерАкта = НомерАкта;
			Документ.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию()	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерАктаСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПриемкаСдачаВыполненныхРаботУслуг.НомерАкта КАК НомерАкта,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Дата КАК Дата,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	|ГДЕ
	|	ПриемкаСдачаВыполненныхРаботУслуг.ПометкаУдаления = ЛОЖЬ
	|	И ПриемкаСдачаВыполненныхРаботУслуг.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВременнаяТаблица.НомерАкта) КАК НомерАкта
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерАкта;
	КонецЦикла;
КонецФункции

&НаСервере 
Функция ПолучитьМассивДокументовСервер(Исполнитель, Организация, ВидРабот, ДатаНачало, ДатаОкончания)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	               |ГДЕ
	               |	ПриемкаСдачаВыполненныхРаботУслуг.Подрядчик = &Исполнитель
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаОкончания
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.ПометкаУдаления = ЛОЖЬ
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.Проведен = ИСТИНА
				   //|	И ПриемкаСдачаВыполненныхРаботУслуг.НомерАкта = 0
	               |	И ПриемкаСдачаВыполненныхРаботУслуг.Организация = &Организация
				   |	И ПриемкаСдачаВыполненныхРаботУслуг.Работы.ВидРабот = &ВидРабот";
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачало", НачалоДня(ДатаНачало));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
	ВыборкаДокументов = Запрос.Выполнить();
	Если НЕ ВыборкаДокументов.Пустой() Тогда
		МассивДокументов = Новый Массив;
		Выборка = ВыборкаДокументов.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДокументов.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Возврат МассивДокументов;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПечатьИтоговСервер(ТабДокумент, ИтогиСумма)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.ПриемкаСдачаРаботМакет");
	Область = Макет.ПолучитьОбласть("Итоги");
	Область.Параметры.ИтогиСумма = ИтогиСумма;
	ТабДокумент.Вывести(Область);
	Возврат ТабДокумент;
КонецФункции

&НаСервере
Функция ПечатьНаСервере(ТабДокумент, МассивДокументов, НомерАкта)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.ПриемкаСдачаРаботМакет");
	ДатаПоследнегоДокумента = Дата(1,1,1);
	ДатаПервогоДокумента = ТекущаяДата();
	Для Каждого Документ Из МассивДокументов Цикл
		Если Документ.Дата > ДатаПоследнегоДокумента Тогда
			ДатаПоследнегоДокумента = Документ.Дата;
		КонецЕсли;	
		Если Документ.Дата < ДатаПервогоДокумента Тогда
			ДатаПервогоДокумента = Документ.Дата;
		КонецЕсли;
		Исполнитель = Документ.Подрядчик;
		ИсполнительНаименование = Документ.Подрядчик.НаименованиеПолное;
		Заказчик = Документ.Организация;
		ЗаказчикНаименование = Документ.Организация.НаименованиеПолное;
		Подразделение = Документ.Подразделение;
	КонецЦикла;
		
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Датаформирования = ТекущаяДата();
	Область.Параметры.ДатаНачало = ДатаПервогоДокумента;
	Область.Параметры.ДатаОкончания = ДатаПоследнегоДокумента;
	Область.Параметры.Исполнитель = ИсполнительНаименование;
	Область.Параметры.Заказчик = ЗаказчикНаименование;
	Область.Параметры.НомерАкта = НомерАкта;
	//Область.Параметры.Подразделение = Подразделение;
	ПолучитьДанныеИсполнителя(Исполнитель,Область);
	ПолучитьДанныеЗаказчика(Заказчик,Область);

	ТабДокумент.Вывести(Область);
	Область = Макет.ПолучитьОбласть("ШапкаТабЧасть");
	ТабДокумент.Вывести(Область);
	Возврат ТабДокумент
КонецФункции

&НаСервере
Процедура ПолучитьДанныеЗаказчика(Организация,Область)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Наименование КАК Наименование,
	               |	Организации.ИНН КАК ИНН,
	               |	ОрганизацииКонтактнаяИнформация.Вид.Наименование КАК ВидНаименование,
	               |	ОрганизацииКонтактнаяИнформация.Представление КАК Представление,
	               |	Организации.ОсновнойБанковскийСчет.Наименование КАК ОсновнойБанковскийСчетНаименование,
	               |	Организации.ОсновнойБанковскийСчет.БИКБанка КАК ОсновнойБанковскийСчетБИКБанка,
	               |	Организации.ОсновнойБанковскийСчет.КоррСчетБанка КАК ОсновнойБанковскийСчетКоррСчетБанка,
	               |	Организации.НаименованиеПолное КАК НаименованиеПолное
	               |ИЗ
	               |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО ОрганизацииКонтактнаяИнформация.Ссылка = Организации.Ссылка
	               |ГДЕ
				   //|	Организации.Наименование ПОДОБНО ""Альтерра ООО"""
				   |	Организации.Ссылка = &Организация";	
	Запрос.УстановитьПараметр("Организация",Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Область.Параметры.Заказчик = Выборка.НаименованиеПолное; 
		Область.Параметры.ИННЗаказчика = Выборка.ИНН; 
		Если Выборка.ВидНаименование = "Юридический адрес" Тогда
			Область.Параметры.АдресЗаказчика = "Юридический адрес: " + Выборка.Представление;
		ИначеЕсли Выборка.ВидНаименование = "Телефон" Тогда
			Область.Параметры.ТелефонЗаказчика  = "тел.: " + Выборка.Представление;
		КонецЕсли;
		Область.Параметры.Банк = "Банк: " +  Выборка.ОсновнойБанковскийСчетНаименование;
		Область.Параметры.БИК = "БИК: " +  Выборка.ОсновнойБанковскийСчетБИКБанка;
		Область.Параметры.КоррСчет = "к/с: " + Выборка.ОсновнойБанковскийСчетКоррСчетБанка; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеИсполнителя(Контрагент, Область)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.Вид.Наименование КАК ВидНаименование,
	               |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
	               |	КонтрагентыКонтактнаяИнформация.Ссылка.ИНН КАК ИНН,
	               |	КонтрагентыКонтактнаяИнформация.Ссылка.КПП КАК КПП
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ первые 1
	               |	БанковскиеСчетаКонтрагентов.Наименование КАК НаименованиеБанка,
	               |	БанковскиеСчетаКонтрагентов.Банк.КоррСчет КАК БанкКоррСчет,
	               |	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
	               |	БанковскиеСчетаКонтрагентов.Банк.Код КАК БанкКод
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	               |		ПО ДоговорыКонтрагентов.БанковскийСчетКонтрагента = БанковскиеСчетаКонтрагентов.Ссылка
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Контрагент = &Контрагент";
				   //|	И ДоговорыКонтрагентов.Наименование = ""Аутсорс""";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаКонтакты = МассивРезультатов[0].Выбрать();
	Пока ВыборкаКонтакты.Следующий() Цикл
		Если ВыборкаКонтакты.ВидНаименование = "Фактический адрес" Тогда
			Область.Параметры.Адрес = "Юридический адрес: " + Строка(ВыборкаКонтакты.Представление);
		ИначеЕсли ВыборкаКонтакты.ВидНаименование = "Адрес" Тогда
			Область.Параметры.Адрес2 = "Адрес для почтовой корреспонденции: " + Строка(ВыборкаКонтакты.Представление);
		ИначеЕсли ВыборкаКонтакты.ВидНаименование = "Электронная почта" Тогда
			Область.Параметры.АдресЭП = "Адрес электронной почты: " + Строка(ВыборкаКонтакты.Представление);
		КонецЕсли;
		Область.Параметры.ИННИсполнителя = "ИНН: " + ВыборкаКонтакты.ИНН;
		Область.Параметры.КППИсполнителя = "КПП: " + ВыборкаКонтакты.КПП;
	КонецЦикла;
	ВыборкаРеквизитыБанка = МассивРезультатов[1].Выбрать();
	Пока ВыборкаРеквизитыБанка.Следующий() Цикл
		Область.Параметры.БанкИсполнителя = "Банк: " + ВыборкаРеквизитыБанка.НаименованиеБанка;
		Область.Параметры.РасчетСчетИсполнителя = "р/c: " + ВыборкаРеквизитыБанка.НомерСчета;
		Область.Параметры.КсчетИсполнителя = "к/с: " + ВыборкаРеквизитыБанка.БанкКоррСчет;
		Область.Параметры.БИКИсполнителя = "БИК: " + ВыборкаРеквизитыБанка.БанкКод;
	КонецЦикла
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервереТабличнаяЧасть(ТабДокумент,Строка,НомерСтроки,ИтогиСумма)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.ПриемкаСдачаРаботМакет");
	Область = Макет.ПолучитьОбласть("ТабЧасть");
	Область.Параметры.НомерСтроки =  НомерСтроки;
	Область.Параметры.ЕдиницыИзмирения = "ч";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ДатаРабот КАК Дата,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подразделение КАК Подразделение,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подразделение.Адрес КАК ПодразделениеАдрес,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ВремяФакт КАК ВремяФакт,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.Сумма КАК Сумма,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ВидРабот.Номенклатура КАК ВидНоменклатуры,
	|	ПриемкаСдачаВыполненныхРаботУслуг.Подрядчик КАК Подрядчик,
	|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ВидРабот КАК ВидРабот
	|ИЗ
	|	Документ.ПриемкаСдачаВыполненныхРаботУслуг.Работы КАК ПриемкаСдачаВыполненныхРаботУслугРаботы
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ПриемкаСдачаВыполненныхРаботУслуг КАК ПриемкаСдачаВыполненныхРаботУслуг
	|		ПО (ПриемкаСдачаВыполненныхРаботУслугРаботы.Ссылка = ПриемкаСдачаВыполненныхРаботУслуг.Ссылка)
	|ГДЕ
	|	ПриемкаСдачаВыполненныхРаботУслуг.Ссылка = &Ссылка
	|ИТОГИ
	|	МИНИМУМ(Дата),
	|	МАКСИМУМ(ПодразделениеАдрес),
	|	СУММА(ВремяФакт),
	|	СУММА(Сумма),
	|	МИНИМУМ(Подрядчик),
	|	МИНИМУМ(ВидРабот),
	|	МАКСИМУМ(Подразделение) КАК Подразделение
	|ПО
	|	ВидНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка", Строка);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидНоменклатуры");
	Пока Выборка.Следующий() Цикл
		Область.Параметры.ВидРабот = Выборка.ВидНоменклатуры;
		Область.Параметры.ДатаДокумента = Выборка.Дата;
		Область.Параметры.Адрес = Выборка.ПодразделениеАдрес;
		Область.Параметры.ВремяФакт = Выборка.ВремяФакт;
		Область.Параметры.Сумма = Выборка.Сумма;
		ПроцентПодрядчика = ПолучитьПроцентПодрядчика(Выборка.Подрядчик);
		Тариф = Документы.ПриемкаСдачаВыполненныхРаботУслуг.ОпределениеЦеныРабот(Выборка.Подрядчик, Выборка.ВидРабот, Выборка.Подразделение);
		Область.Параметры.ТарифПоМесяцу = (Тариф *(ПроцентПодрядчика/100)) + Тариф; 
		ИтогиСумма = ИтогиСумма+Выборка.Сумма;
		СотрудникЗаказчик = АльтерраОбщегоНазначения.ПолучитьСотрудника(Строка.Заказчик);
		Область.Параметры.СекцияЗаказчик = СотрудникЗаказчик.Отдел;
		мФИОРаботников = ПолучитьФИОРаботников(Строка);
		стрФИОРаботников = СтрСоединить(мФИОРаботников, Символы.ПС);
		Область.Параметры.ФИОРаботников = стрФИОРаботников;
	КонецЦикла;
	ТабДокумент.Вывести(Область);
	
	Структура = Новый Структура("ТабДокумент", "ИтогиСумма", Неопределено, Неопределено);
	Структура.Вставить("ТабДокумент", ТабДокумент);
	Структура.Вставить("ИтогиСумма", ИтогиСумма);
	Возврат Структура;
КонецФункции

&НаСервере
Функция ПолучитьПроцентПодрядчика(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ДополнительныеСведения.Объект = Контрагенты.Партнер)
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И Контрагенты.Ссылка = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ПроцентАутсорс");
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Значение;			
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьФИОРаботников(Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриемкаСдачаВыполненныхРаботУслугРаботы.ФИОРаботника КАК ФИОРаботника
		|ИЗ
		|	Документ.ПриемкаСдачаВыполненныхРаботУслуг.Работы КАК ПриемкаСдачаВыполненныхРаботУслугРаботы
		|ГДЕ
		|	ПриемкаСдачаВыполненныхРаботУслугРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	МассивРаботников = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивРаботников.Добавить(Выборка.ФИОРаботника);
	КонецЦикла;
	Возврат МассивРаботников;
КонецФункции


&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СвойМассивЗначений = ОтборПартнера();
	ПараметрыОтбора = Новый Структура("Ссылка", СвойМассивЗначений);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора); 
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыОткрытия,Элемент, ЭтаФорма);
КонецПроцедуры 

&НаСервере
Функция ОтборПартнера()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Партнер
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (ДополнительныеСведения.Объект = Контрагенты.Партнер)
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование ПОДОБНО  ""%ПроцентАутсорс%""
	|	И ДополнительныеСведения.Значение > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивПартнеров = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивПартнеров.Добавить(Выборка.Партнер);
	КонецЦикла;
	Возврат МассивПартнеров;
КонецФункции


&НаКлиенте
Процедура ВидРаботНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.Очистить();
	СвойМассивЗначений = ОтборНоменклатурыПартнера(Исполнитель);
	Элемент.СписокВыбора.ЗагрузитьЗначения(СвойМассивЗначений);
	Партнер = ПартнерНаСервере();
	ПараметрыОтбора = Новый Структура("ВладелецНоменклатуры", Партнер);
	ПараметрыОткрытия = Новый Структура("Отбор", ПараметрыОтбора); 
	ОткрытьФорму("Справочник.НоменклатураКонтрАгентов.ФормаВыбора", ПараметрыОткрытия, Элемент, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПартнерНаСервере()
	Возврат Исполнитель.Партнер;
КонецФункции

&НаСервере
Функция ОтборНоменклатурыПартнера(Подрядчик)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (НоменклатураКонтрагентов.ВладелецНоменклатуры = Контрагенты.Партнер)
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Подрядчик);
	Выборка = запрос.Выполнить().Выбрать();
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Ссылка);
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	СвойМассивЗначений = ОтборНоменклатурыПартнера(Исполнитель);
	Элементы.ВидРабот.СписокВыбора.ЗагрузитьЗначения(СвойМассивЗначений);
КонецПроцедуры
